# Difference between two dates in days , weeks, Months and years in Pandas python

### Source
http://www.datasciencemadesimple.com/difference-two-dates-days-weeks-months-years-pandas-python-2/

In [0]:
import pandas as pd
import numpy as np
import datetime

from dateutil.relativedelta import relativedelta
from datetime import date

In [0]:
date1 = pd.Series(pd.date_range('2012-1-1 12:00:00', periods=7, freq='M'))
date2 = pd.Series(pd.date_range('2013-3-11 21:45:00', periods=7, freq='W'))

In [3]:
date1

0   2012-01-31 12:00:00
1   2012-02-29 12:00:00
2   2012-03-31 12:00:00
3   2012-04-30 12:00:00
4   2012-05-31 12:00:00
5   2012-06-30 12:00:00
6   2012-07-31 12:00:00
dtype: datetime64[ns]

In [4]:
date2

0   2013-03-17 21:45:00
1   2013-03-24 21:45:00
2   2013-03-31 21:45:00
3   2013-04-07 21:45:00
4   2013-04-14 21:45:00
5   2013-04-21 21:45:00
6   2013-04-28 21:45:00
dtype: datetime64[ns]

In [5]:
df = pd.DataFrame(dict(Start_date=date1, End_date=date2))
df

           Start_date            End_date
0 2012-01-31 12:00:00 2013-03-17 21:45:00
1 2012-02-29 12:00:00 2013-03-24 21:45:00
2 2012-03-31 12:00:00 2013-03-31 21:45:00
3 2012-04-30 12:00:00 2013-04-07 21:45:00
4 2012-05-31 12:00:00 2013-04-14 21:45:00
5 2012-06-30 12:00:00 2013-04-21 21:45:00
6 2012-07-31 12:00:00 2013-04-28 21:45:00

### Difference between two dates in days – pandas dataframe python

* First line calculates the difference between two dates
* Second line converts the difference in terms of days (`timedelta64(1,’D’)` - `D` indicates days)

In [6]:
df['diff_days'] = df['End_date'] - df['Start_date']
df

           Start_date            End_date         diff_days
0 2012-01-31 12:00:00 2013-03-17 21:45:00 411 days 09:45:00
1 2012-02-29 12:00:00 2013-03-24 21:45:00 389 days 09:45:00
2 2012-03-31 12:00:00 2013-03-31 21:45:00 365 days 09:45:00
3 2012-04-30 12:00:00 2013-04-07 21:45:00 342 days 09:45:00
4 2012-05-31 12:00:00 2013-04-14 21:45:00 318 days 09:45:00
5 2012-06-30 12:00:00 2013-04-21 21:45:00 295 days 09:45:00
6 2012-07-31 12:00:00 2013-04-28 21:45:00 271 days 09:45:00

In [7]:
df['diff_days'] = df['diff_days'] / np.timedelta64(1, 'D')
df

           Start_date            End_date  diff_days
0 2012-01-31 12:00:00 2013-03-17 21:45:00  411.40625
1 2012-02-29 12:00:00 2013-03-24 21:45:00  389.40625
2 2012-03-31 12:00:00 2013-03-31 21:45:00  365.40625
3 2012-04-30 12:00:00 2013-04-07 21:45:00  342.40625
4 2012-05-31 12:00:00 2013-04-14 21:45:00  318.40625
5 2012-06-30 12:00:00 2013-04-21 21:45:00  295.40625
6 2012-07-31 12:00:00 2013-04-28 21:45:00  271.40625

### Difference between two dates in weeks – pandas dataframe python

* First line calculates the difference between two dates
* Second line converts the difference in terms of weeks (`timedelta64(1,’W’)` - `W` indicates weeks)

In [8]:
df['diff_weeks'] = df['End_date'] - df['Start_date']
df['diff_weeks'] = df['diff_weeks'] / np.timedelta64(1, 'W')

df

           Start_date            End_date  diff_days  diff_weeks
0 2012-01-31 12:00:00 2013-03-17 21:45:00  411.40625   58.772321
1 2012-02-29 12:00:00 2013-03-24 21:45:00  389.40625   55.629464
2 2012-03-31 12:00:00 2013-03-31 21:45:00  365.40625   52.200893
3 2012-04-30 12:00:00 2013-04-07 21:45:00  342.40625   48.915179
4 2012-05-31 12:00:00 2013-04-14 21:45:00  318.40625   45.486607
5 2012-06-30 12:00:00 2013-04-21 21:45:00  295.40625   42.200893
6 2012-07-31 12:00:00 2013-04-28 21:45:00  271.40625   38.772321

### Difference between two dates in Months – pandas dataframe python

* First line calculates the difference between two dates
* Second line converts the difference in terms of Months (`timedelta64(1,’M’)` -  capital `M` indicates Months)

In [9]:
df['diff_months'] = df['End_date'] - df['Start_date']
df['diff_months'] = df['diff_months'] / np.timedelta64(1, 'M')

df

           Start_date            End_date  diff_days  diff_weeks  diff_months
0 2012-01-31 12:00:00 2013-03-17 21:45:00  411.40625   58.772321    13.516705
1 2012-02-29 12:00:00 2013-03-24 21:45:00  389.40625   55.629464    12.793897
2 2012-03-31 12:00:00 2013-03-31 21:45:00  365.40625   52.200893    12.005380
3 2012-04-30 12:00:00 2013-04-07 21:45:00  342.40625   48.915179    11.249718
4 2012-05-31 12:00:00 2013-04-14 21:45:00  318.40625   45.486607    10.461200
5 2012-06-30 12:00:00 2013-04-21 21:45:00  295.40625   42.200893     9.705538
6 2012-07-31 12:00:00 2013-04-28 21:45:00  271.40625   38.772321     8.917021

### Difference between two dates in Years – pandas dataframe python

* First line calculates the difference between two dates
* Second line converts the difference in terms of Years (`timedelta64(1,’Y’)` - `Y` indicates years)

In [10]:
df['diff_years'] = df['End_date'] - df['Start_date']
df['diff_years'] = df['diff_years'] / np.timedelta64(1, 'Y')

df

           Start_date            End_date  ...  diff_months  diff_years
0 2012-01-31 12:00:00 2013-03-17 21:45:00  ...    13.516705    1.126392
1 2012-02-29 12:00:00 2013-03-24 21:45:00  ...    12.793897    1.066158
2 2012-03-31 12:00:00 2013-03-31 21:45:00  ...    12.005380    1.000448
3 2012-04-30 12:00:00 2013-04-07 21:45:00  ...    11.249718    0.937476
4 2012-05-31 12:00:00 2013-04-14 21:45:00  ...    10.461200    0.871767
5 2012-06-30 12:00:00 2013-04-21 21:45:00  ...     9.705538    0.808795
6 2012-07-31 12:00:00 2013-04-28 21:45:00  ...     8.917021    0.743085

[7 rows x 6 columns]